examples/porousHeatTransferFoam/PCMValidations/multiLayer/GR27-GR41-charge/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh

restore0Dir

runApplication setFields
runApplication $(getApplication)
paraFoam -touch -vtk

#------------------------------------------------------------------------------
