examples/porousHeatTransferFoam/PCMValidations/multiLayer/GR27-GR41-charge/constant/thermophysicalProperties.solid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         multiComponentMixture;
    transport       constIso;
    thermo          hMeltingSolidificationCubic;//hNonsymErf;//
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

species (GR27 GR41);

Tph1 310;
Tph2 328;

GR27
{
    specie
    {
        molWeight   50;
    }

    transport
    {
        kappa   0.2;
    }

    thermodynamics
    {
        Hf			55800;
        CpS			2050;
		CpL      	1921;
		Tph			#eval "273+27.5";
		T1	#eval "273+23";
		T2		#eval "273+27.8";
    }

    equationOfState
    {
        rho     1360;
    }
}

GR41
{
    specie
    {
        molWeight   50;
    }

    transport
    {
        kappa   0.2;
    }

    thermodynamics
    {
        Hf			29000;
        CpS			2784;
		CpL      	2785;
		Tph			#eval "273+41.5";
		T1	#eval "273+35";
		T2		#eval "273+44.5";
    }

    equationOfState
    {
        rho     1360;
    }
}

// ************************************************************************* //
